import React from 'react'

const Level1 = () => {
  return (
    <div className="text-gray-200 px-8 py-4 text-justify">
      <h1>Level I</h1>
      <p className="question">
        Q1 Расскажите, чем, на ваш взгляд, отличается хорошая верстка от плохой с точки зрения
        <br /> - пользователя; <br /> - менеджера проекта; <br /> - дизайнера; <br /> -
        верстальщика; <br />
        - клиентского программиста; <br /> - серверного программиста.
      </p>
      <p className="answer">
        A1 ans1ите основные особенности верстки крупных многостраничных сайтов, дизайн которых может
        меняться в процессе реализации и поддержки. Расскажите о своем опыте верстки подобных
        сайтов: какие методологии, инстр
      </p>
      <p className="question">
        Q2 Опишите основные особенности верстки крупных многостраничных сайтов, дизайн которых может
        меняться в процессе реализации и поддержки. Расскажите о своем опыте верстки подобных
        сайтов: какие методологии, инструменты и технологии вы применяли на практике.
      </p>
      <p className="answer">ans1</p>
      <p className="question">
        Q3 Опишите основные особенности верстки сайтов, которые должны одинаково хорошо отображаться
        как на любом современном компьютере, так и на смартфонах и планшетах под управлением iOS и
        Android. Расскажите о своем опыте верстки подобных сайтов: какие инструменты и технологии вы
        применяли, как проверяли результат на различных устройствах, какие именно устройства
        требовалось поддерживать.
      </p>
      <p className="answer">ans1</p>
      <p className="question">
        Q4 Расскажите, какие инструменты помогают вам экономить время в процессе написания, проверки
        и отладки кода.
      </p>
      <p className="answer">ans1</p>
      <p className="question">
        Q5 Вам нужно понять, почему страница отображается некорректно в Safari на iOS и в IE на
        Windows. Код писали не вы, доступа к исходникам у вас нет. Ваши действия? Сталкивались ли вы
        с подобными проблемами на практике?{' '}
      </p>
      <p className="answer">ans1</p>
      <p className="question">
        Q6 Дизайнер отдал вам макет, в котором не показано, как должны выглядеть интерактивные
        элементы при наведении мыши. Ваши действия?
      </p>
      <p className="answer">ans1</p>
      <p className="question">
        Q7 Какие ресурсы вы используете для развития в профессиональной сфере? Приведите несколько
        конкретных примеров (сайты, блоги и так далее). Какое направление развития вам более близко:
        JS-программирование, HTML/CSS- верстка или что-то ещё? Какие ещё области знаний, кроме тех,
        что непосредственно относятся к работе, вам интересны?
      </p>
      <p className="answer">ans1</p>
      <p className="question">
        Q8 Расскажите нам о себе и предоставьте несколько ссылок на последние работы, выполненные
        вами.
      </p>
      <p className="answer">ans1</p>
    </div>
  )
}

export default Level1
